### Import Libraries

In [12]:
import pandas as pd
import numpy as np

### Creating DataFrame

In [33]:
my_dict = {
    'feature1':['Male','','Female','Male','Male'],
    'feature2':[23,24,25,26,27],
    'feature3':[24,25,26,27,28],
    'feature4':['Yes','No','Yes','Yes','Yes']
}

df = pd.DataFrame(my_dict, columns = ['feature1','feature2','feature3','feature4'])
data = df.to_csv('data1.csv')

### Load and Read the Dataset

In [34]:
df = pd.read_csv('data1.csv')

In [35]:
df.head()

   Unnamed: 0 feature1  feature2  feature3 feature4
0           0     Male        23        24      Yes
1           1      NaN        24        25       No
2           2   Female        25        26      Yes
3           3     Male        26        27      Yes
4           4     Male        27        28      Yes

In [36]:
df = df.drop(['Unnamed: 0'], axis = 1)

In [37]:
df

  feature1  feature2  feature3 feature4
0     Male        23        24      Yes
1      NaN        24        25       No
2   Female        25        26      Yes
3     Male        26        27      Yes
4     Male        27        28      Yes

#### Find the number of missing values per column.

In [38]:
df.isnull().sum()

feature1    1
feature2    0
feature3    0
feature4    0
dtype: int64

In [39]:
df1 = df.copy()

### Apply Strategy-1(Delete the missing observations).

In [40]:
df1.dropna(inplace=True, axis=0)
df1.head()

  feature1  feature2  feature3 feature4
0     Male        23        24      Yes
2   Female        25        26      Yes
3     Male        26        27      Yes
4     Male        27        28      Yes

### Apply Strategy-2(Replace missing values with the most frequent value).

In [41]:
df2 = df.fillna(df1.mode().iloc[0])

In [42]:
df2

  feature1  feature2  feature3 feature4
0     Male        23        24      Yes
1     Male        24        25       No
2   Female        25        26      Yes
3     Male        26        27      Yes
4     Male        27        28      Yes

### Apply Strategy-3(Delete the variable which is having missing values).

In [47]:
df1.dropna(inplace=True, axis=1)
# df3.head()

In [49]:
df1

  feature1  feature2  feature3 feature4
0     Male        23        24      Yes
2   Female        25        26      Yes
3     Male        26        27      Yes
4     Male        27        28      Yes